#+TITLE: Tzeract Sport Development Process
#+STARTUP: shrink
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{listing}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{adjustbox}
#+LATEX_HEADER: \usepackage[margin=2cm]{geometry}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=black}

* Introduction 

* Data Acquisition
** Introduction
** Governing Bodies
** Event Groups
** Teams

* Development 
** Data Feed Provider Integration
*** Fixtures Integration

** Platform Integration
*** Ingest Infrastructure
*** Run Infrastructure

* Neural Net
** Data Sources
*** Introduction

*** Kambi Closing Odds

*** Fixtures and Match Occurrences 
Fixture and match occurrence data is sourced from team Rico in Kambi. The data is shared through the AWS S3 bucket 
/*prod-datalake-sharing*/ which can be updated with more recent data by making a request to Team Rico [fn:1]. The
data should be moved to the AWS S3 bucket /*tzeract-datalake-sharing*/ that's owned by Tzeract to ensure that any 
costs associated with this bucket's use is attributed to Tzeract; syncing between S3 buckets can be accomplished by
invoking the following command

#+BEGIN_EXPORT latex
\begin{figure}[thp]\centering
  \begin{minted}[
frame=lines,
framesep=2mm,
baselinestretch=1.2,
fontsize=\footnotesize,
linenos
]{bash}
    aws s3 sync s3://prod-datalake-sharing s3://tzeract-datalake-sharing --profile tzeract
  \end{minted}
\caption{S3 Bucket Sync}\label{lst:awsBucketSync}
\end{figure}
#+END_EXPORT
@@latex:\noindent@@ where the /tzeract/ profile must be added to the user's AWS config ~/.aws/config/.

*** AWS S3 Bucket Contents
The /tzeract-datalake-sharing/ S3 bucket contains fixture, match occurrence and miscellaneous data. Fixture data
may be needed for league, team and player related information; match occurrences will comprise the live events that 
occurred in a given fixture. Note that Betgenius match occurrences belong to Genius fixtures while Betradar match
occurrences belong to Sportradar fixtures; Genius and Sportradar match occurrences are a separate products that
nevertheless share fixtures. 

#+NAME: Bucket Sizes
#+ATTR_LATEX: :spread :width 10cm  :align |p{7cm}|p{2cm}|p{3cm}|
#+ATTR_LATEX: :scale 25.0
|--------------------------------------------+-----------+--------------|
| Topic                                      | Size (GB) | Object Count |
|--------------------------------------------+-----------+--------------|
| db.v2.external.runningBall.fixture         |     320.5 |       249304 |
| db.v2.external.runningBall.matchOccurrence |      15.2 |        77596 |
| db.v2.external.genius.fixture              |      17.2 |        18518 |
| db.v2.external.betgenius.matchOccurrence   |      31.7 |       104844 |
| db.v2.external.sportradar.fixture          |     307.3 |       407266 |
| db.v2.external.betradar.matchOccurrence    |      62.6 |       160139 |
| db.v2.external.infront.fixture             |      19.0 |        26366 |
| db.v2.external.infront.matchOccurrence     |       4.6 |        27351 |
| db.v2.external.img.fixture                 |      71.8 |       163101 |
| db.v2.external.img.matchOccurrence         |       2.3 |        14665 |
| db.v2.internal.feed.mapping                |       1.2 |      153,128 |
|--------------------------------------------+-----------+--------------|
| Totals                                     |     853.4 |      1249431 |
|--------------------------------------------+-----------+--------------|
#+TBLFM: @>$2=vsum(@<<$2..@>>$2)
#+TBLFM: @>$3=vsum(@<<$3..@>>$3)

**** Data Lake Sharing

* Footnotes

[fn:1] https://jira.services.kambi.com/secure/RapidBoard.jspa?rapidView=1068&projectKey=DL
